wisteria-1c/Конфигурация/Catalogs/ЗадачиАссистентаПоСогласованиюЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЗадачиАссистентаПоСогласованиюЗаявок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоПоприветствовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОповещений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСогласованияЗаявок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбщегоОбсуждения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательДляОповещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОповещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособОповещенияАссистентаУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетнаяЗапись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправитьВ8</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправитьВ12</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправитьВ16</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Enums/СпособОповещенияАссистентаУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособОповещенияАссистентаУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияБезОповещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияОтветственному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбщегоОбсуждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеЛичногоОбсужденияПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеЛичногоОбсужденияОтветственному</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/ЗадачиАссистентаПоСогласованиюЗаявок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Ложь;
	ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
	
	АссистентУправления.УдалитьЗапланированныеЗаписиЗадачи(Ссылка);
	ЗапланироватьНовыеЗадачи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередВыполнениемЗадачи(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Возврат;
		
КонецПроцедуры

Процедура ВыполнитьЗадачу(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМаршрутизациюЗаявок") Тогда
		Возврат;
	КонецЕсли;	
	
	АктуальныеОповещенияПоЗаявкам = АктуальныеОповещенияПоЗаявкам();
	
	ПараметрыСогласованияЗаявокСвернуто = АктуальныеОповещенияПоЗаявкам.Скопировать();
	ПараметрыСогласованияЗаявокСвернуто.Свернуть("Идентификатор, ИдентификаторОбщегоОбсуждения, ПользовательДляОповещения,
		|СпособОповещения, УчетнаяЗапись, ОтправитьВ8, ОтправитьВ12, ОтправитьВ16");
	ПараметрыСогласованияЗаявокСвернуто.Колонки.Добавить("ЭтоОтправкаСообщенияОбсуждения");
	ПараметрыСогласованияЗаявокСвернуто.Колонки.Добавить("ЭтоОтправкаEmail");
	ПараметрыСогласованияЗаявокСвернуто.Колонки.Добавить("ЕстьЗаявкиКСогласованию");
	
	Для Каждого СтрокаСогласованияЗаявок Из ПараметрыСогласованияЗаявокСвернуто Цикл
		
		СтрокаСогласованияЗаявок.ЭтоОтправкаСообщенияОбсуждения = ЭтоОтправкаСообщенияОбсуждения(СтрокаСогласованияЗаявок);
		СтрокаСогласованияЗаявок.ЭтоОтправкаEmail = ЭтоОтправкаEmail(СтрокаСогласованияЗаявок);
		СтрокаСогласованияЗаявок.ЕстьЗаявкиКСогласованию = ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ИдентификаторОбщегоОбсуждения)
			Или РегистрыСведений.СогласованиеЗаявок.ЕстьЗаявкиНаСогласование(СтрокаСогласованияЗаявок.ПользовательДляОповещения);
		
		Если Не СтрокаСогласованияЗаявок.ЭтоОтправкаEmail И Не СтрокаСогласованияЗаявок.ЭтоОтправкаСообщенияОбсуждения Тогда
			ТекстОшибки = НСтр("ru='Не заполнен ни адрес электронной почты, ни обсуждение для отправки сообщения.'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЦикла;	

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Идентификатор");
	ПараметрыОтбора.Вставить("ИдентификаторОбщегоОбсуждения");
	ПараметрыОтбора.Вставить("ПользовательДляОповещения");
	ПараметрыОтбора.Вставить("СпособОповещения");
	ПараметрыОтбора.Вставить("УчетнаяЗапись");
	ПараметрыОтбора.Вставить("ОтправитьВ8");
	ПараметрыОтбора.Вставить("ОтправитьВ12");
	ПараметрыОтбора.Вставить("ОтправитьВ16");
	
	Для Каждого СтрокаАктуальногоОповещенияПоЗаявке Из АктуальныеОповещенияПоЗаявкам Цикл

		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаАктуальногоОповещенияПоЗаявке);
		СтрокиСогласованияЗаявок = ПараметрыСогласованияЗаявокСвернуто.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиСогласованияЗаявок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСогласованияЗаявок = СтрокиСогласованияЗаявок[0];
		
		НужноОповестить = Истина;
		ТекущееВремя = Час(ТекущаяДатаСеанса());

		Если ТекущееВремя >= 8 И ТекущееВремя < 12 Тогда
			НужноОповестить = СтрокаАктуальногоОповещенияПоЗаявке.ОтправитьВ8;
		ИначеЕсли ТекущееВремя >= 12 И ТекущееВремя < 16 Тогда
			НужноОповестить = СтрокаАктуальногоОповещенияПоЗаявке.ОтправитьВ12;
		ИначеЕсли ТекущееВремя >= 16 И ТекущееВремя < 20 Тогда
			НужноОповестить = СтрокаАктуальногоОповещенияПоЗаявке.ОтправитьВ16;
		Иначе
			НужноОповестить = Ложь;
		КонецЕсли;
		
		Если Не СтрокаСогласованияЗаявок.ЕстьЗаявкиКСогласованию Или Не НужноОповестить Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщенияНапоминаниеОСогласованииЗаявок(СтрокаСогласованияЗаявок.ЭтоОтправкаEmail);

		Если СтрокаСогласованияЗаявок.ЭтоОтправкаEmail Тогда
			СоздатьEmail(СтрокаСогласованияЗаявок, ТекстСообщения);
		Иначе
			ДанныеСообщения = ОбсужденияУНФ.НовыйДанныеСообщения();
			ДанныеСообщения.Текст = ТекстСообщения;
			ДобавитьКнопкуДействияДляСообщения(ДанныеСообщения.Действия);
			СоздатьСообщениеОбсуждения(СтрокаСогласованияЗаявок, ДанныеСообщения);
		КонецЕсли;
		
		ПараметрыСогласованияЗаявокСвернуто.Удалить(СтрокаСогласованияЗаявок);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПослеВыполненияЗадачи(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НеобходимоПоприветствовать Тогда
		СброситьПризнакНеобходимоПоприветствовать();
	КонецЕсли;
	ЗапланироватьНовыеЗадачи();
	
КонецПроцедуры

Процедура ПоприветствоватьПользователяПередПервымВыполнением() Экспорт
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Используется Тогда
		Возврат;
	КонецЕсли;
	
	Если АссистентУправления.Подключен() Тогда 

		ПараметрыСогласованияЗаявокСвернуто = ПараметрыСогласованияЗаявок.Выгрузить();
		ПараметрыСогласованияЗаявокСвернуто.Свернуть("Идентификатор, ИдентификаторОбщегоОбсуждения, ПользовательДляОповещения,
		|СпособОповещения, УчетнаяЗапись");
		
		Для Каждого СтрокаСогласованияЗаявки Из ПараметрыСогласованияЗаявокСвернуто Цикл
			
			ЭтоОтправкаСообщенияОбсуждения = ЭтоОтправкаСообщенияОбсуждения(СтрокаСогласованияЗаявки);
			ЭтоОтправкаEmail = ЭтоОтправкаEmail(СтрокаСогласованияЗаявки);
			
			Если Не ЭтоОтправкаEmail И Не ЭтоОтправкаСообщенияОбсуждения Тогда
				ТекстОшибки = НСтр("ru='Не заполнен ни адрес электронной почты, ни обсуждение для отправки сообщения.'");
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			ДанныеСообщения = ОбсужденияУНФ.НовыйДанныеСообщения();
			ДанныеСообщения.Текст = ТекстСообщенияПриветствиеПередПервымВыполнением();
			ДанныеСообщения.Получатель = СтрокаСогласованияЗаявки.ПользовательДляОповещения;
			СоздатьСообщениеОбсуждения(СтрокаСогласованияЗаявки, ДанныеСообщения, Истина);
			
		КонецЦикла;	
		
	КонецЕсли;
	
	НовыеЗадачиКВыполнению = АссистентУправления.НовыйТаблицаРегулярныхЗадачКВыполнению();
	НоваяЗадача = НовыеЗадачиКВыполнению.Добавить();
	НоваяЗадача.Дата = НачалоДня(ТекущаяДатаСеанса());
	НоваяЗадача.Задача = Ссылка;
	
	АссистентУправления.ЗапланироватьВыполнениеРегулярныхЗадач(НовыеЗадачиКВыполнению);
	АссистентУправления.ВыполнитьРегулярныеЗадачиСейчасВФоне();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗапланироватьНовыеЗадачи()
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Используется Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗадачиКВыполнению = АссистентУправления.НовыйТаблицаРегулярныхЗадачКВыполнению();
	МассивЗадач = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);
	Справочники.ЗадачиАссистентаПоСогласованиюЗаявок.ЗапланироватьЗадачиКВыполнению(
		НовыеЗадачиКВыполнению, МассивЗадач);
		
	Если НовыеЗадачиКВыполнению.Количество() <> 0 Тогда
		АссистентУправления.ЗапланироватьВыполнениеРегулярныхЗадач(НовыеЗадачиКВыполнению);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстСообщенияПриветствиеПередПервымВыполнением()
	
	ТекстСообщения = НСтр("ru='Я буду напоминать о завках на расход денег, которые Вам нужно согласовать.'");
	
	ДобавитьТекстДобрыйДень(ТекстСообщения);
	
	ТекстСообщения = СтрШаблон(ТекстСообщения); 
	
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ДобавитьТекстДобрыйДень(ТекстСообщения)
	
	КомпонентыСтроки = Новый Массив;
	КомпонентыСтроки.Добавить(НСтр("ru='Добрый день!'")); // АПК:374
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(ТекстСообщения);
	ТекстСообщения = СтрСоединить(КомпонентыСтроки);
	
КонецПроцедуры

Процедура ДобавитьТекстПодписи(ТекстСообщения)
	
	КомпонентыСтроки = Новый Массив;
	КомпонентыСтроки.Добавить(ТекстСообщения);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(Символы.ПС);
	ПодписьТекст = НСтр("ru='С уважением, Даша
	|Ассистент 1С:Управление нашей фирмой'");
	КомпонентыСтроки.Добавить(ПодписьТекст);
	ТекстСообщения = СтрСоединить(КомпонентыСтроки);
	
КонецПроцедуры

Функция ТекстСообщенияНапоминаниеОСогласованииЗаявок(ЭтоОтправкаEmail)
	
	ТекстСообщения = НСтр("ru='Напоминаю, что пришло время согласовать заявки.'");
	
	Если ЭтоОтправкаEmail Тогда
		ДобавитьТекстДобрыйДень(ТекстСообщения);
		ДобавитьТекстПодписи(ТекстСообщения);
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ЭтоОтправкаEmail(СтрокаСогласованияЗаявок)
	
	Возврат ЗначениеЗаполнено(СтрокаСогласованияЗаявок.УчетнаяЗапись)
		И ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ПользовательДляОповещения); 
	
КонецФункции

Функция ЭтоОтправкаСообщенияОбсуждения(СтрокаСогласованияЗаявок)
	
	Если СтрокаСогласованияЗаявок.СпособОповещения =
			Перечисления.СпособОповещенияАссистентаУправления.СообщениеЛичногоОбсужденияПользователю
		И ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ПользовательДляОповещения) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаСогласованияЗаявок.СпособОповещения =
			Перечисления.СпособОповещенияАссистентаУправления.СообщениеОбщегоОбсуждения 
		И ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ИдентификаторОбщегоОбсуждения) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СоздатьEmail(СтрокаСогласованияЗаявок, ТекстСообщения)
	
	ПредставлениеПолучателя =
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСогласованияЗаявок.ПользовательДляОповещения, "Наименование");
	КонтактнаяИнформацияПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		СтрокаСогласованияЗаявок.ПользовательДляОповещения,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, , Ложь);
	АдресаЭлектроннойПочты = Новый Массив;
	СоответствиеАдресов = Новый Соответствие;
	Для каждого ДанныеКонтактнойИнформации Из КонтактнаяИнформацияПользователя Цикл
		ОписаниеПолучателя = Новый Структура;
		ОписаниеПолучателя.Вставить("Адрес", ДанныеКонтактнойИнформации.Представление);
		ОписаниеПолучателя.Вставить("Представление", ПредставлениеПолучателя);
		АдресаЭлектроннойПочты.Добавить(ОписаниеПолучателя);
		СоответствиеАдресов.Вставить(ПредставлениеПолучателя, ДанныеКонтактнойИнформации.Представление);
	КонецЦикла;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", АдресаЭлектроннойПочты);
	ПараметрыПисьма.Вставить("Тема", НСтр("ru='Напоминание о завках к согласованию'"));
	ПараметрыПисьма.Вставить("Тело", ТекстСообщения);
	ПараметрыПисьма.Вставить("ТипТекста", ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	ПочтовоеСообщение =
		РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(СтрокаСогласованияЗаявок.УчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(СтрокаСогласованияЗаявок.УчетнаяЗапись, ПочтовоеСообщение);
	
КонецПроцедуры

Процедура СоздатьСообщениеОбсуждения(СтрокаСогласованияЗаявок, ДанныеСообщения, ОтправитьСейчас = Ложь)
	
	Если ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ИдентификаторОбщегоОбсуждения) Тогда
		ДанныеСообщения.Объект =
			Новый ИдентификаторОбсужденияСистемыВзаимодействия(СтрокаСогласованияЗаявок.ИдентификаторОбщегоОбсуждения);
	ИначеЕсли ЗначениеЗаполнено(СтрокаСогласованияЗаявок.ПользовательДляОповещения) Тогда
		ДанныеСообщения.Объект = СтрокаСогласованияЗаявок.ПользовательДляОповещения;
	Иначе
		ТекстОшибки =
			НСтр("ru='У задачи не заполнены параметры: ""Пользователь для оповещения"" или ""Общее обсуждение"".'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	ДанныеСообщения.Автор = АссистентУправления.ПользовательАссистент();
	
	Если ОтправитьСейчас Тогда
		ОбсужденияУНФ.СоздатьСообщение(ДанныеСообщения);
	Иначе
		ОбсужденияУНФ.СоздатьСообщениеОтложенно(ДанныеСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура СброситьПризнакНеобходимоПоприветствовать()
	
	ОбменДаннымиЗагрузка = ОбменДанными.Загрузка;
	ОбменДанными.Загрузка = Истина;
	НеобходимоПоприветствовать = Ложь;
	Записать();
	ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
	
КонецПроцедуры

Процедура ДобавитьКнопкуДействияДляСообщения(ДействияСообщения)

	ДействияСообщения.Добавить("ПерейтиКДокументамРасходДСПланНаСогласование",
			НСтр("ru='Перейти к заявкам на расход денег'"));
	
КонецПроцедуры

Функция АктуальныеОповещенияПоЗаявкам()

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыСогласованияЗаявок.Идентификатор КАК Идентификатор,
	|	ПараметрыСогласованияЗаявок.ИдентификаторОбщегоОбсуждения КАК ИдентификаторОбщегоОбсуждения,
	|	ПараметрыСогласованияЗаявок.ПользовательДляОповещения КАК ПользовательДляОповещения,
	|	ПараметрыСогласованияЗаявок.СпособОповещения КАК СпособОповещения,
	|	ПараметрыСогласованияЗаявок.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ПараметрыСогласованияЗаявок.ОтправитьВ8 КАК ОтправитьВ8,
	|	ПараметрыСогласованияЗаявок.ОтправитьВ12 КАК ОтправитьВ12,
	|	ПараметрыСогласованияЗаявок.ОтправитьВ16 КАК ОтправитьВ16
	|ИЗ
	|	Справочник.ЗадачиАссистентаПоСогласованиюЗаявок.ПараметрыСогласованияЗаявок КАК ПараметрыСогласованияЗаявок";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
